NCE3/L17 The longest suspension bridge in the world.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>
* Lesson 17 The longest suspension bridge in the world
#+begin_verse
How is the bridge supported?

Verrazano, an Italian *about whom little is known*,
	sailed into New York Harbour in 1524 and named it Angouleme.
He *described it as* 'a very *agreeable situation* *located within* two small hills
	*in the midst of* which flowed a great river.'
Though Verrazano *is by no means considered to be* a great explorer,
	his name will probably remain immortal,
	for on November 21st, 1964, the longest suspension bridge in the world *was named after* him.

The Verrazano Bridge, which was designed by Othmar Ammann, *joins Brooklyn to Staten Island*.
It has *a span of* 4,260 feet.
The bridge is so long that the shape of the earth had to *be taken into account* by its designer.
Two great towers support four huge cables.
The towers are built on immense underwater platforms made of steel and concrete.
The platforms extend to a depth of over 100 feet under the sea.
These alone took sixteen months to build.
Above the surface of the water, the towers rise to *a height of* nearly 700 feet.
They support the cables *from which the bridge has been suspended*.
Each of the four cables contains 26,108 *lengths of wire*.
*It has been estimated that* if the bridge *were packed with* cars,
		it would still only be carrying *a third of* its total capacity.
However, size and strength are not the only important things about this bridge.
Despite its immensity, it is both simple and elegant,
	*fulfilling its designer's dream* to create 'an enormous object drawn as faintly as possible'.
#+end_verse
** expression
suspension: [səˈspenʃ(ə)n] n. suspend v.悬挂,悬职
agreeable: [əˈɡriəb(ə)l] adj. situation n.宜人的风景
locate: [ˈloʊˌkeɪt] v. location n.坐落
immortal: [ɪˈmɔrt(ə)l] adj. so famous that it will never be forgotten永生的,流芳百世的
span: [spæn] n.  a period of time between two dates or events跨度
cable: [ˈkeɪb(ə)l] n. a plastic or rubber tube containing wires that carry telephone messages, electronic signals, television pictures etc缆索
concrete: [ˈkɑŋˌkrit] n.混凝土
length: [leŋθ] n.长
estimate: [ˈestɪmət] v.估计
capacity: [kəˈpæsəti] n.承受量
immensity: [ɪˈmensəti] n.巨大
elegant: [ˈelɪɡənt] adj.优美别致的
faintly: [ˈfeɪntli] adv.轻微地

agreeable/pleasant + situation/man/day: 宜人的环境
be located in/near: 坐落于/靠近...
a span of ...: ...的跨度
life span: 寿命
a length of/lengths of + rope/pipe/wire: 一段绳/管/线
It is estimated that + ...: 据估计+...
sb. estimates that + ...: 某人估计+...
--------------------
little/not much/not everything is known about a.: 对A知之甚少
describe A as B: 把A描述成B
in the midst of ...:在...的中间
by no means: not possible绝无可能
be considered to be adj./n.: 被认为是...
sth. be named after sb.: 某物以某人命名
join a. to b. = connect a. to b.: 连接A和B
be taken into account = take sth. into account 考虑某事
a height of ...: ...的高度
A be suspended from B: A悬挂于B
be packed with ...: to fill something with things or people of a particular type挤满,塞满
a third of sth: 某物的1/3
fulfill sb's dream: something or someone made your dream come true实现某人的梦想

** words
suspension [səˈspenʃ(ə)n] n.吊
agreeable [əˈɡriːəb(ə)l] adj.宜人的
situation [ˌsɪtʃuˈeɪʃ(ə)n] n.地点
locate [ˈloʊkeɪt] v.位于
immortal [ɪˈmɔːrt(ə)l] adj.永生的
Brooklyn [ˈbrʊklɪn; ˈbrʊklən] n.布鲁克林
Staten [nil] n.斯塔顿
span [spæn] n.跨度
cable [ˈkeɪb(ə)l] n.缆索
concrete [ˈkɑːnkriːt] n.混凝土
suspend [səˈspend] v.悬挂
length [leŋθ] n.根,段
estimate [ˈestɪmət] v.估计
capacity [kəˈpæsəti] n.承受量
immensity [ɪˈmensəti] n.巨大
elegant [ˈelɪɡənt] adj.优美别致的
faintly [ˈfeɪntli] adv.微细地

** vocabulary
agreeable situation: nice location
in the midst: in the middle of
considered: thought
remain immortal: never die
span: extent
taken into account: taken into consideration
support: hold

