NCE3/L17 The longest suspension bridge in the world.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-28 Sat 22:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-orgb68df48" class="outline-2">
<h2 id="orgb68df48">Lesson 17 The longest suspension bridge in the world</h2>
<div class="outline-text-2" id="text-orgb68df48">
<p class="verse">
How is the bridge supported?<br />
<br />
Verrazano, an Italian <b>about whom little is known</b>,<br />
&#xa0;sailed into New York Harbour in 1524 and named it Angouleme.<br />
He <b>described it as</b> 'a very <b>agreeable situation</b> <b>located within</b> two small hills<br />
&#xa0;<b>in the midst of</b> which flowed a great river.'<br />
Though Verrazano <b>is by no means considered to be</b> a great explorer,<br />
&#xa0;his name will probably remain immortal,<br />
&#xa0;for on November 21st, 1964, the longest suspension bridge in the world <b>was named after</b> him.<br />
<br />
The Verrazano Bridge, which was designed by Othmar Ammann, <b>joins Brooklyn to Staten Island</b>.<br />
It has <b>a span of</b> 4,260 feet.<br />
The bridge is so long that the shape of the earth had to <b>be taken into account</b> by its designer.<br />
Two great towers support four huge cables.<br />
The towers are built on immense underwater platforms made of steel and concrete.<br />
The platforms extend to a depth of over 100 feet under the sea.<br />
These alone took sixteen months to build.<br />
Above the surface of the water, the towers rise to <b>a height of</b> nearly 700 feet.<br />
They support the cables <b>from which the bridge has been suspended</b>.<br />
Each of the four cables contains 26,108 <b>lengths of wire</b>.<br />
<b>It has been estimated that</b> if the bridge <b>were packed with</b> cars,<br />
&#xa0;&#xa0;it would still only be carrying <b>a third of</b> its total capacity.<br />
However, size and strength are not the only important things about this bridge.<br />
Despite its immensity, it is both simple and elegant,<br />
&#xa0;<b>fulfilling its designer's dream</b> to create 'an enormous object drawn as faintly as possible'.<br />
</p>
</div>
<div id="outline-container-org8eb4b2d" class="outline-3">
<h3 id="org8eb4b2d">expression</h3>
<div class="outline-text-3" id="text-org8eb4b2d">
<p>
suspension: [səˈspenʃ(ə)n] n. suspend v.悬挂,悬职<br />
agreeable: [əˈɡriəb(ə)l] adj. situation n.宜人的风景<br />
locate: [ˈloʊˌkeɪt] v. location n.坐落<br />
immortal: [ɪˈmɔrt(ə)l] adj. so famous that it will never be forgotten永生的,流芳百世的<br />
span: [spæn] n.  a period of time between two dates or events跨度<br />
cable: [ˈkeɪb(ə)l] n. a plastic or rubber tube containing wires that carry telephone messages, electronic signals, television pictures etc缆索<br />
concrete: [ˈkɑŋˌkrit] n.混凝土<br />
length: [leŋθ] n.长<br />
estimate: [ˈestɪmət] v.估计<br />
capacity: [kəˈpæsəti] n.承受量<br />
immensity: [ɪˈmensəti] n.巨大<br />
elegant: [ˈelɪɡənt] adj.优美别致的<br />
faintly: [ˈfeɪntli] adv.轻微地<br />
</p>

<p>
agreeable/pleasant + situation/man/day: 宜人的环境<br />
be located in/near: 坐落于/靠近&#x2026;<br />
a span of &#x2026;: &#x2026;的跨度<br />
life span: 寿命<br />
a length of/lengths of + rope/pipe/wire: 一段绳/管/线<br />
It is estimated that + &#x2026;: 据估计+&#x2026;<br />
sb. estimates that + &#x2026;: 某人估计+&#x2026;<br />
</p>
<hr />
<p>
little/not much/not everything is known about a.: 对A知之甚少<br />
describe A as B: 把A描述成B<br />
in the midst of &#x2026;:在&#x2026;的中间<br />
by no means: not possible绝无可能<br />
be considered to be adj./n.: 被认为是&#x2026;<br />
sth. be named after sb.: 某物以某人命名<br />
join a. to b. = connect a. to b.: 连接A和B<br />
be taken into account = take sth. into account 考虑某事<br />
a height of &#x2026;: &#x2026;的高度<br />
A be suspended from B: A悬挂于B<br />
be packed with &#x2026;: to fill something with things or people of a particular type挤满,塞满<br />
a third of sth: 某物的1/3<br />
fulfill sb's dream: something or someone made your dream come true实现某人的梦想<br />
</p>
</div>
</div>

<div id="outline-container-org0bbc9f5" class="outline-3">
<h3 id="org0bbc9f5">words</h3>
<div class="outline-text-3" id="text-org0bbc9f5">
<p>
suspension [səˈspenʃ(ə)n] n.吊<br />
agreeable [əˈɡriːəb(ə)l] adj.宜人的<br />
situation [ˌsɪtʃuˈeɪʃ(ə)n] n.地点<br />
locate [ˈloʊkeɪt] v.位于<br />
immortal [ɪˈmɔːrt(ə)l] adj.永生的<br />
Brooklyn [ˈbrʊklɪn; ˈbrʊklən] n.布鲁克林<br />
Staten [nil] n.斯塔顿<br />
span [spæn] n.跨度<br />
cable [ˈkeɪb(ə)l] n.缆索<br />
concrete [ˈkɑːnkriːt] n.混凝土<br />
suspend [səˈspend] v.悬挂<br />
length [leŋθ] n.根,段<br />
estimate [ˈestɪmət] v.估计<br />
capacity [kəˈpæsəti] n.承受量<br />
immensity [ɪˈmensəti] n.巨大<br />
elegant [ˈelɪɡənt] adj.优美别致的<br />
faintly [ˈfeɪntli] adv.微细地<br />
</p>
</div>
</div>

<div id="outline-container-org4077950" class="outline-3">
<h3 id="org4077950">vocabulary</h3>
<div class="outline-text-3" id="text-org4077950">
<p>
agreeable situation: nice location<br />
in the midst: in the middle of<br />
considered: thought<br />
remain immortal: never die<br />
span: extent<br />
taken into account: taken into consideration<br />
support: hold<br />
</p>
</div>
</div>
