NCE3/L17 The longest suspension bridge in the world.org
** DONE 单词造句
CLOSED: [2023-11-19 Sun 15:14]
suspension n. suspend v.
- There used to be a suspension bridge over the river.
- This suspension bridge is considered as an agreeable situation.
- He was tied to a chair on the suspension bridge.
- I will tell you about the history of the suspension bridge.
- I was astonished to find that the suspension bridge was damaged by army.
agreeable adj. situation n.  agreeable/pleasant + situation/man/day
- There is a long time when West Lake was considered as an agreeable situation.
- I spent an agreeable day at this hotel in the remote village.
- I was not allowed to meet her, for she is agreeable.
- What is more, this agreeable situation was filled up with people.
- The house's situation by the river is agreeable.
locate v. location n.  be located in/near
- My house used to be located near a river.
- He found his way at the hotel located near the lake.
- The city mall in a beautiful situation is very popular with these young people.
- Our stadium located in the park will have been built by the last day of this year.
- His house in a beautiful location has been sold last month.
immortal adj.
- Plato has claimed that the soul is immortal.
- He soon made a name for himself and would probably be immortal.
- After put out of business, the man remained immortal.
- The soldier which remains immortal made a name for himself during the war.
- There was a time when people there believed in an immortal goddess.
span n.  a span of  life span
- Over a span of ten years, Leo began to make a profit.
- It was obvious that the bridge has over a span of 100 meters.
- In a span of ten years, this country has been at war with his neighbor.
- If the bridge had a span of 100 meters, it wouldn't be enough strong.
- My cat's life span is over ten years.
cable n.
- If you damaged this cable, you would pay large sums of money to the authorities.
- There was a time when the electric cables were stolen by villagers.
- In times of war, the electric cables were damaged by fire.
- She wanted to devote herself to making discovery of cables.
- For your own protection, don't touch these cables.
concrete n.
- In memory of these hero, the authorities have built a concrete monument.
- The baby hit himself on the concrete floor and then let out a cry.
- The tall building is made of steel and concrete.
- He realized to his horror that his child hit himself on the concrete floor.
- This concrete wall was regarded as watertight.
length n.  a length of/lengths of + rope/pipe/wire
- The policeman arrived on the scene seeing a cut length of rope.
- I exchanged some money for lengths of wire.
- The worker was accused of stealing lengths of wire in the factory.
- I found the worker stealing lengths of wire.
- However, the worker denied taking all 500 lengths of wire.
estimate v.  It is estimated that + ...  sb. estimates that + ...
- It is estimated that the cat was tied to a chair.
- He estimated that small sums would go a long way.
- He estimated that
		the lady who owned the sweets shop would rewarded him with a bar of chocolate. 
- He estimates that they will have a enough supply of foods and water.
- It is estimated that the soldiers will leave if they are offered enough money.
capacity n.
- The bottle only has a capacity of a second of 1 liter.
- Do the water tanks provide a capacity of 1 liter?
- For your own protection, you'd better take the bottle which has a capacity of 1 liter.
- He made the remarkable discovery that the river has a capacity of two millions of liter.
- The stadium which will have been built by next year will have a seating capacity of 50,000.
immensity n.
- I wouldn't never realize the immensity of the earth, if I didn't go to university.
- I am very nervous about the immensity of the task.
- I realized the immensity of the task when I drived on to my friend's house.
- Despite of the immensity of task, she managed to finish it.
- I will have a difficult time because of the immmensity of my task.
elegant adj.
- Not only did he buy his wife an elegant dress, but he bougth his mother another.
- Not only did he buy his wife an elegant dress, but he gave her a splendid performance.
- The chairman was standing in the midst of these elegant women.
- These elegant women are going to give five performance.
- I waved to the elegant woman and asked for a lift.
faintly adv.
- He smiled faintly and knocked her to the ground suddenly.
- The sun always shines faintly through these leaves.
- He rolled up his sleeves faintly and began to do his work.
- It bounced faintly and disappeared down a drain.
- Although he glanced at the elegant woman faintly, his wife noticed this and got very angry.

** DONE 反复听电影片段直到懂关键句
CLOSED: [2023-11-19 Sun 20:25]
** 复习二册语法(笔记或视频) & 红皮书
