NCE3/L17 The longest suspension bridge in the world.html

<div id="outline-container-org97e0099" class="outline-3">
<h3 id="org97e0099"><span class="done DONE">DONE</span> 单词造句</h3>
<div class="outline-text-3" id="text-org97e0099">
<p>
suspension n. suspend v.<br />
</p>
<ul class="org-ul">
<li>There used to be a suspension bridge over the river.<br /></li>
<li>This suspension bridge is considered as an agreeable situation.<br /></li>
<li>He was tied to a chair on the suspension bridge.<br /></li>
<li>I will tell you about the history of the suspension bridge.<br /></li>
<li>I was astonished to find that the suspension bridge was damaged by army.<br /></li>
</ul>
<p>
agreeable adj. situation n.  agreeable/pleasant + situation/man/day<br />
</p>
<ul class="org-ul">
<li>There is a long time when West Lake was considered as an agreeable situation.<br /></li>
<li>I spent an agreeable day at this hotel in the remote village.<br /></li>
<li>I was not allowed to meet her, for she is agreeable.<br /></li>
<li>What is more, this agreeable situation was filled up with people.<br /></li>
<li>The house's situation by the river is agreeable.<br /></li>
</ul>
<p>
locate v. location n.  be located in/near<br />
</p>
<ul class="org-ul">
<li>My house used to be located near a river.<br /></li>
<li>He found his way at the hotel located near the lake.<br /></li>
<li>The city mall in a beautiful situation is very popular with these young people.<br /></li>
<li>Our stadium located in the park will have been built by the last day of this year.<br /></li>
<li>His house in a beautiful location has been sold last month.<br /></li>
</ul>
<p>
immortal adj.<br />
</p>
<ul class="org-ul">
<li>Plato has claimed that the soul is immortal.<br /></li>
<li>He soon made a name for himself and would probably be immortal.<br /></li>
<li>After put out of business, the man remained immortal.<br /></li>
<li>The soldier which remains immortal made a name for himself during the war.<br /></li>
<li>There was a time when people there believed in an immortal goddess.<br /></li>
</ul>
<p>
span n.  a span of  life span<br />
</p>
<ul class="org-ul">
<li>Over a span of ten years, Leo began to make a profit.<br /></li>
<li>It was obvious that the bridge has over a span of 100 meters.<br /></li>
<li>In a span of ten years, this country has been at war with his neighbor.<br /></li>
<li>If the bridge had a span of 100 meters, it wouldn't be enough strong.<br /></li>
<li>My cat's life span is over ten years.<br /></li>
</ul>
<p>
cable n.<br />
</p>
<ul class="org-ul">
<li>If you damaged this cable, you would pay large sums of money to the authorities.<br /></li>
<li>There was a time when the electric cables were stolen by villagers.<br /></li>
<li>In times of war, the electric cables were damaged by fire.<br /></li>
<li>She wanted to devote herself to making discovery of cables.<br /></li>
<li>For your own protection, don't touch these cables.<br /></li>
</ul>
<p>
concrete n.<br />
</p>
<ul class="org-ul">
<li>In memory of these hero, the authorities have built a concrete monument.<br /></li>
<li>The baby hit himself on the concrete floor and then let out a cry.<br /></li>
<li>The tall building is made of steel and concrete.<br /></li>
<li>He realized to his horror that his child hit himself on the concrete floor.<br /></li>
<li>This concrete wall was regarded as watertight.<br /></li>
</ul>
<p>
length n.  a length of/lengths of + rope/pipe/wire<br />
</p>
<ul class="org-ul">
<li>The policeman arrived on the scene seeing a cut length of rope.<br /></li>
<li>I exchanged some money for lengths of wire.<br /></li>
<li>The worker was accused of stealing lengths of wire in the factory.<br /></li>
<li>I found the worker stealing lengths of wire.<br /></li>
<li>However, the worker denied taking all 500 lengths of wire.<br /></li>
</ul>
<p>
estimate v.  It is estimated that + &#x2026;  sb. estimates that + &#x2026;<br />
</p>
<ul class="org-ul">
<li>It is estimated that the cat was tied to a chair.<br /></li>
<li>He estimated that small sums would go a long way.<br /></li>
<li>He estimated that<br />
the lady who owned the sweets shop would rewarded him with a bar of chocolate.<br /></li>
<li>He estimates that they will have a enough supply of foods and water.<br /></li>
<li>It is estimated that the soldiers will leave if they are offered enough money.<br /></li>
</ul>
<p>
capacity n.<br />
</p>
<ul class="org-ul">
<li>The bottle only has a capacity of a second of 1 liter.<br /></li>
<li>Do the water tanks provide a capacity of 1 liter?<br /></li>
<li>For your own protection, you'd better take the bottle which has a capacity of 1 liter.<br /></li>
<li>He made the remarkable discovery that the river has a capacity of two millions of liter.<br /></li>
<li>The stadium which will have been built by next year will have a seating capacity of 50,000.<br /></li>
</ul>
<p>
immensity n.<br />
</p>
<ul class="org-ul">
<li>I wouldn't never realize the immensity of the earth, if I didn't go to university.<br /></li>
<li>I am very nervous about the immensity of the task.<br /></li>
<li>I realized the immensity of the task when I drived on to my friend's house.<br /></li>
<li>Despite of the immensity of task, she managed to finish it.<br /></li>
<li>I will have a difficult time because of the immmensity of my task.<br /></li>
</ul>
<p>
elegant adj.<br />
</p>
<ul class="org-ul">
<li>Not only did he buy his wife an elegant dress, but he bougth his mother another.<br /></li>
<li>Not only did he buy his wife an elegant dress, but he gave her a splendid performance.<br /></li>
<li>The chairman was standing in the midst of these elegant women.<br /></li>
<li>These elegant women are going to give five performance.<br /></li>
<li>I waved to the elegant woman and asked for a lift.<br /></li>
</ul>
<p>
faintly adv.<br />
</p>
<ul class="org-ul">
<li>He smiled faintly and knocked her to the ground suddenly.<br /></li>
<li>The sun always shines faintly through these leaves.<br /></li>
<li>He rolled up his sleeves faintly and began to do his work.<br /></li>
<li>It bounced faintly and disappeared down a drain.<br /></li>
<li>Although he glanced at the elegant woman faintly, his wife noticed this and got very angry.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org95556a9" class="outline-3">
<h3 id="org95556a9"><span class="done DONE">DONE</span> 反复听电影片段直到懂关键句</h3>
<div class="outline-text-3" id="text-org95556a9">
</div>
</div>
<div id="outline-container-orgbb331d2" class="outline-3">
<h3 id="orgbb331d2">复习二册语法(笔记或视频) &amp; 红皮书</h3>
</div>
