NCE3/L17 The longest suspension bridge in the world.org
** DONE 习惯用法造句
CLOSED: [2023-11-19 Sun 15:14]
little/not much/not everything is known about a.
- Little is known about the capicity of the bridge.
- Little is known about the immensity of the task.
- Little is known about the man who worked for the coporation.
- Not everything is known about the mummy made in 4th century.
- Little is known about the history of my house.
describe a. as b.
- We are used to describe a luck man as a lucky dog.
- The captain was described as a immortal hero.
- I described my youth as a time of fear and confusion.
- He stated that his children used to describe him as a good father.
- Why did you describe this rude man as elegant?
in the midst of
- There used to be a hut in the midst of the forest.
- A groud of singers will give five performance in the midst of the park.
- The chairman was standing in the midst of people.
- The building is located in the midst of the city.
- He will be working in the midst of the city.
by no means
- He is by no means proud of such a rude father.
- She will by no means be away from her children.
- I will be by no means nervous about telling stories in public.
- Sorry to interrupt, I by no means afford to pay the bill.
- She by no means looks up in any dictionary.
be considered to be adj./n.
- The tatanic was considered to be unsinkable, for she had 15 watertight compartments.
- She was considered to be right, but she made an tremendous mistake recently.
- I was considered to be best student of my class.
- She was considered to be the prettiest girl I have ever seen.
- My was considered to be ugly before she dyed her hair black.
sth. be named after sb.
- My children are not allowed to be named after me.
- My father claimed to have named me after the chair man.
- She made an impact on my monther, and my mother named me after her.
- It seems that I was named after the great leader.
- I am likely to name my son after my cat.
join a. to b. = connect a. to b.
- This mountain road joins our village to my wife's village.
- The bridge which is being built will join Shenzhen to Hongkong.
- There is a small bridge joining my house to the other side of the river.
- The tunnel joins the England to the mainland.
- This great suspension bridge joins the Blooklyn block to the Staten island.
be taken into account = take sth. into account
- You must take into account the fact
		that if we were fired, we would get enought money to pay the bill.
- She always takes a variety of factors into account.
- He took into account the fact that he was fired and ran out of his money.
- This lady took her husband into account and bought her husband a special type of play station.
- The captain took into account the fact that the ship was sinking.
a height of + (长度 100m)
- The aircraft was supposed to be flying at a height of 100 meters.
- The kite is not allowed to be flying at a height of 50 meters in this country.
- Imagine her dismay when she found that she couldn't eat at a height of 100 meters.
- The balloon which reached a height of 100 meters was damaged by a plane.
- They managed to catch a ballon which reached a height of 100 meters.
be suspended from a.
- There used to be a beautiful light suspended from the ceiling.
- She was suspended from school for 3 days, for she played truent from school.
- Ross complained that he was suspended from museum for his angry.
- The order to suspended the light from the ceiling was given.
- So long ago as ten days before, the policewoman was suspended from duty.
be packed with ...
- The station was packed with young men and women, for a group of pop singer arrived.
- The lot was soon packed with a lot of automobiles.
- He realized to his horror that the mall was packed with workers.
- Being packed with people, the house is not cold any more.
- It will be packed with the fans of Mr. Messi.
a third of sth
- Only a third of cat died from falling tall buildings.
- You have just finished a third of your homework.
- If we get married, I will keep only a third of money and the rest is for you.
- There is no shortage of fuel, I have only used a third of it.
- There was a third of workers who were trapped in the mine.
fulfill sb's dream
- I fulfilled my dream of getting marry to her.
- If you don't work hard, you will never fulling your dream of going to university.
- Now that you have enough money,
		it's time to fulfill your dream of travelling all over the world.
- Fulfilling his dream, he made an impact on young men all over the world.
- Fulfilling his dream, he made everything official.

** 跟读 50遍
** DONE Comprehension 反复练习
CLOSED: [2023-11-19 Sun 20:26]
** DONE Ask me if 写+读
CLOSED: [2023-11-19 Sun 20:36]
1. Verrazano sailed into New York Harbour in 152- When
	 When did Verrazano sail into New York Harbour?
2. Verrazano is considered to be a great explorer. Why isn't
		Why isn't Verrazano considered to be a great explorer?
3. The Verrazano bridge was designed by Othmar Ammann. Who
		Who was the Verrazano bridge designed by?
4. Two towers support four huge cables. How many towers
		How many towers support four huge cables?
5. The platforms extend to a depth of over 100 feet under the sea. How far
		How far do the platforms extend to a depth of under the sea?
6. The platforms took sixteen months to build. How long
	 How long did the platforms take to build?
7. They rise to nearly 700 feet. How far
	 How far do they rise to?
8. Each cable contains 26,108 lengths of wire. How many lengths
	 How many lengths of wire does each cable contain?
9. The bridge is packed with cars. How often
	 How often is the bridge packed with cars?
10. It fulfils its designer's dream. How
		How does it fulfil its designer's dream?

** DONE 摘要写作 写 & 对答案
CLOSED: [2023-11-19 Sun 20:47]
The Verrazano bridge, which joins Brooklyn to Staten Island,
	has a span of 4,260 feet.
Its two great towers support four huge cables.
The towers are built on the platfroms made of steel and concrete,
	extending over 100 feet under the sea
	and rising nearly 700 feet above the suface of the water.
The bridge is suspended from four huge cables,
	each of which contains 26,108 lengths of wire.
Not only is the birdge very strong, but simple and elegant as well.
	
** DONE tell the story 口语复述
CLOSED: [2023-11-19 Sun 20:54]
