NCE3/L17 The longest suspension bridge in the world.html
<div id="outline-container-orge3b1487" class="outline-3">
<h3 id="orge3b1487"><span class="done DONE">DONE</span> 习惯用法造句</h3>
<div class="outline-text-3" id="text-orge3b1487">
<p>
little/not much/not everything is known about a.<br />
</p>
<ul class="org-ul">
<li>Little is known about the capicity of the bridge.<br /></li>
<li>Little is known about the immensity of the task.<br /></li>
<li>Little is known about the man who worked for the coporation.<br /></li>
<li>Not everything is known about the mummy made in 4th century.<br /></li>
<li>Little is known about the history of my house.<br /></li>
</ul>
<p>
describe a. as b.<br />
</p>
<ul class="org-ul">
<li>We are used to describe a luck man as a lucky dog.<br /></li>
<li>The captain was described as a immortal hero.<br /></li>
<li>I described my youth as a time of fear and confusion.<br /></li>
<li>He stated that his children used to describe him as a good father.<br /></li>
<li>Why did you describe this rude man as elegant?<br /></li>
</ul>
<p>
in the midst of<br />
</p>
<ul class="org-ul">
<li>There used to be a hut in the midst of the forest.<br /></li>
<li>A groud of singers will give five performance in the midst of the park.<br /></li>
<li>The chairman was standing in the midst of people.<br /></li>
<li>The building is located in the midst of the city.<br /></li>
<li>He will be working in the midst of the city.<br /></li>
</ul>
<p>
by no means<br />
</p>
<ul class="org-ul">
<li>He is by no means proud of such a rude father.<br /></li>
<li>She will by no means be away from her children.<br /></li>
<li>I will be by no means nervous about telling stories in public.<br /></li>
<li>Sorry to interrupt, I by no means afford to pay the bill.<br /></li>
<li>She by no means looks up in any dictionary.<br /></li>
</ul>
<p>
be considered to be adj./n.<br />
</p>
<ul class="org-ul">
<li>The tatanic was considered to be unsinkable, for she had 15 watertight compartments.<br /></li>
<li>She was considered to be right, but she made an tremendous mistake recently.<br /></li>
<li>I was considered to be best student of my class.<br /></li>
<li>She was considered to be the prettiest girl I have ever seen.<br /></li>
<li>My was considered to be ugly before she dyed her hair black.<br /></li>
</ul>
<p>
sth. be named after sb.<br />
</p>
<ul class="org-ul">
<li>My children are not allowed to be named after me.<br /></li>
<li>My father claimed to have named me after the chair man.<br /></li>
<li>She made an impact on my monther, and my mother named me after her.<br /></li>
<li>It seems that I was named after the great leader.<br /></li>
<li>I am likely to name my son after my cat.<br /></li>
</ul>
<p>
join a. to b. = connect a. to b.<br />
</p>
<ul class="org-ul">
<li>This mountain road joins our village to my wife's village.<br /></li>
<li>The bridge which is being built will join Shenzhen to Hongkong.<br /></li>
<li>There is a small bridge joining my house to the other side of the river.<br /></li>
<li>The tunnel joins the England to the mainland.<br /></li>
<li>This great suspension bridge joins the Blooklyn block to the Staten island.<br /></li>
</ul>
<p>
be taken into account = take sth. into account<br />
</p>
<ul class="org-ul">
<li>You must take into account the fact<br />
that if we were fired, we would get enought money to pay the bill.<br /></li>
<li>She always takes a variety of factors into account.<br /></li>
<li>He took into account the fact that he was fired and ran out of his money.<br /></li>
<li>This lady took her husband into account and bought her husband a special type of play station.<br /></li>
<li>The captain took into account the fact that the ship was sinking.<br /></li>
</ul>
<p>
a height of + (长度 100m)<br />
</p>
<ul class="org-ul">
<li>The aircraft was supposed to be flying at a height of 100 meters.<br /></li>
<li>The kite is not allowed to be flying at a height of 50 meters in this country.<br /></li>
<li>Imagine her dismay when she found that she couldn't eat at a height of 100 meters.<br /></li>
<li>The balloon which reached a height of 100 meters was damaged by a plane.<br /></li>
<li>They managed to catch a ballon which reached a height of 100 meters.<br /></li>
</ul>
<p>
be suspended from a.<br />
</p>
<ul class="org-ul">
<li>There used to be a beautiful light suspended from the ceiling.<br /></li>
<li>She was suspended from school for 3 days, for she played truent from school.<br /></li>
<li>Ross complained that he was suspended from museum for his angry.<br /></li>
<li>The order to suspended the light from the ceiling was given.<br /></li>
<li>So long ago as ten days before, the policewoman was suspended from duty.<br /></li>
</ul>
<p>
be packed with &#x2026;<br />
</p>
<ul class="org-ul">
<li>The station was packed with young men and women, for a group of pop singer arrived.<br /></li>
<li>The lot was soon packed with a lot of automobiles.<br /></li>
<li>He realized to his horror that the mall was packed with workers.<br /></li>
<li>Being packed with people, the house is not cold any more.<br /></li>
<li>It will be packed with the fans of Mr. Messi.<br /></li>
</ul>
<p>
a third of sth<br />
</p>
<ul class="org-ul">
<li>Only a third of cat died from falling tall buildings.<br /></li>
<li>You have just finished a third of your homework.<br /></li>
<li>If we get married, I will keep only a third of money and the rest is for you.<br /></li>
<li>There is no shortage of fuel, I have only used a third of it.<br /></li>
<li>There was a third of workers who were trapped in the mine.<br /></li>
</ul>
<p>
fulfill sb's dream<br />
</p>
<ul class="org-ul">
<li>I fulfilled my dream of getting marry to her.<br /></li>
<li>If you don't work hard, you will never fulling your dream of going to university.<br /></li>
<li>Now that you have enough money,<br />
it's time to fulfill your dream of travelling all over the world.<br /></li>
<li>Fulfilling his dream, he made an impact on young men all over the world.<br /></li>
<li>Fulfilling his dream, he made everything official.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org1e26751" class="outline-3">
<h3 id="org1e26751">跟读 50遍</h3>
</div>
<div id="outline-container-orgdf9d928" class="outline-3">
<h3 id="orgdf9d928"><span class="done DONE">DONE</span> Comprehension 反复练习</h3>
<div class="outline-text-3" id="text-orgdf9d928">
</div>
</div>
<div id="outline-container-org36b6396" class="outline-3">
<h3 id="org36b6396"><span class="done DONE">DONE</span> Ask me if 写+读</h3>
<div class="outline-text-3" id="text-org36b6396">
<ol class="org-ol">
<li>Verrazano sailed into New York Harbour in 152- When<br />
When did Verrazano sail into New York Harbour?<br /></li>
<li>Verrazano is considered to be a great explorer. Why isn't<br />
Why isn't Verrazano considered to be a great explorer?<br /></li>
<li>The Verrazano bridge was designed by Othmar Ammann. Who<br />
Who was the Verrazano bridge designed by?<br /></li>
<li>Two towers support four huge cables. How many towers<br />
How many towers support four huge cables?<br /></li>
<li>The platforms extend to a depth of over 100 feet under the sea. How far<br />
How far do the platforms extend to a depth of under the sea?<br /></li>
<li>The platforms took sixteen months to build. How long<br />
How long did the platforms take to build?<br /></li>
<li>They rise to nearly 700 feet. How far<br />
How far do they rise to?<br /></li>
<li>Each cable contains 26,108 lengths of wire. How many lengths<br />
How many lengths of wire does each cable contain?<br /></li>
<li>The bridge is packed with cars. How often<br />
How often is the bridge packed with cars?<br /></li>
<li>It fulfils its designer's dream. How<br />
How does it fulfil its designer's dream?<br /></li>
</ol>
</div>
</div>

<div id="outline-container-org2ca4d66" class="outline-3">
<h3 id="org2ca4d66"><span class="done DONE">DONE</span> 摘要写作 写 &amp; 对答案</h3>
<div class="outline-text-3" id="text-org2ca4d66">
<p>
The Verrazano bridge, which joins Brooklyn to Staten Island,<br />
	has a span of 4,260 feet.<br />
Its two great towers support four huge cables.<br />
The towers are built on the platfroms made of steel and concrete,<br />
	extending over 100 feet under the sea<br />
	and rising nearly 700 feet above the suface of the water.<br />
The bridge is suspended from four huge cables,<br />
	each of which contains 26,108 lengths of wire.<br />
Not only is the birdge very strong, but simple and elegant as well.<br />
</p>
</div>
</div>

<div id="outline-container-org68c90c2" class="outline-3">
<h3 id="org68c90c2"><span class="done DONE">DONE</span> tell the story 口语复述</h3>
<div class="outline-text-3" id="text-org68c90c2">
</div>
</div>
