NCE3/L17 The longest suspension bridge in the world.org
** DONE composition 阅读 或 写作
CLOSED: [2023-11-19 Sun 20:57]
The bridge I know best is called the Sydney Harbour Bridge.
It joins either side of Sydney Harbour.
From far away it looks like a great arch,
	but when you get near, you can see a great deck under the arch.
It is made of steel and supported by two towers.
If you stand on the bridge early in the morning,
	you can see the Parramatta River to the west and the open sea to the east.
At this time everything is quiet.

During the day, however, the harbour becomes busy with small boats
	and largeships are moving in all directions.
I enjoy standing on the bridge at night
	when you see the magnificent Opera House looking like a great sailing ship.
In the darkness you can see the city lights.
In the stillness the traffic and the movement of the sea are the only sounds that can be heard.

** Topics for discussion
