NCE3/L17 The longest suspension bridge in the world.html
<div id="outline-container-org242e471" class="outline-3">
<h3 id="org242e471"><span class="done DONE">DONE</span> composition 阅读 或 写作</h3>
<div class="outline-text-3" id="text-org242e471">
<p>
The bridge I know best is called the Sydney Harbour Bridge.<br />
It joins either side of Sydney Harbour.<br />
From far away it looks like a great arch,<br />
	but when you get near, you can see a great deck under the arch.<br />
It is made of steel and supported by two towers.<br />
If you stand on the bridge early in the morning,<br />
	you can see the Parramatta River to the west and the open sea to the east.<br />
At this time everything is quiet.<br />
</p>

<p>
During the day, however, the harbour becomes busy with small boats<br />
	and largeships are moving in all directions.<br />
I enjoy standing on the bridge at night<br />
	when you see the magnificent Opera House looking like a great sailing ship.<br />
In the darkness you can see the city lights.<br />
In the stillness the traffic and the movement of the sea are the only sounds that can be heard.<br />
</p>
</div>
</div>

<div id="outline-container-org011ec17" class="outline-3">
<h3 id="org011ec17">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
